In [1]:
import pandas as pd
from matplotlib import pyplot as plt
import numpy as np

In [2]:
dict = {'Name': ["Nick Solmayor", "Nadjie Solmayor", "Rodolfo Gemora", "Alex Bello","Abelardo Ybanez"], 'Age': [43, 44, 55,48,61], 'Sex' : ["M","F","M","M","M"], 'Status' : ["Single","Married","Single","Married","Seperated"], 'Year_Stayed' : [45,40,10,25, 60]}
df = pd.DataFrame(dict)
df

              Name  Age Sex     Status  Year_Stayed
0    Nick Solmayor   43   M     Single           45
1  Nadjie Solmayor   44   F    Married           40
2   Rodolfo Gemora   55   M     Single           10
3       Alex Bello   48   M    Married           25
4  Abelardo Ybanez   61   M  Seperated           60

In [4]:
df.Name.iloc[0]

'Nick Solmayor'

In [4]:
df.Name.iloc[0]

'Nick Solmayor'

In [3]:
df.Name.iloc[1]

'Nadjie Solmayor'

In [5]:
df.set_index("Name", inplace=True)

In [6]:
df

                 Age Sex     Status  Year_Stayed
Name
Nick Solmayor     43   M     Single           45
Nadjie Solmayor   44   F    Married           40
Rodolfo Gemora    55   M     Single           10
Alex Bello        48   M    Married           25
Abelardo Ybanez   61   M  Seperated           60

In [7]:
df.reset_index("Name", inplace=True)

In [8]:
df

              Name  Age Sex     Status  Year_Stayed
0    Nick Solmayor   43   M     Single           45
1  Nadjie Solmayor   44   F    Married           40
2   Rodolfo Gemora   55   M     Single           10
3       Alex Bello   48   M    Married           25
4  Abelardo Ybanez   61   M  Seperated           60

In [9]:
df.Name.sort_values()

4    Abelardo Ybanez
3         Alex Bello
1    Nadjie Solmayor
0      Nick Solmayor
2     Rodolfo Gemora
Name: Name, dtype: object

In [10]:
df.Name.sort_values(ascending=False)

2     Rodolfo Gemora
0      Nick Solmayor
1    Nadjie Solmayor
3         Alex Bello
4    Abelardo Ybanez
Name: Name, dtype: object

In [11]:
df.sort_values('Name')

              Name  Age Sex     Status  Year_Stayed
4  Abelardo Ybanez   61   M  Seperated           60
3       Alex Bello   48   M    Married           25
1  Nadjie Solmayor   44   F    Married           40
0    Nick Solmayor   43   M     Single           45
2   Rodolfo Gemora   55   M     Single           10

In [12]:
df.Year_Stayed

0    45
1    40
2    10
3    25
4    60
Name: Year_Stayed, dtype: int64

In [13]:
df.Year_Stayed.sort_values()

2    10
3    25
1    40
0    45
4    60
Name: Year_Stayed, dtype: int64

In [13]:
df.sort_values("Year_Stayed")

              Name  Age Sex     Status  Year_Stayed
2   Rodolfo Gemora   55   M     Single           10
3       Alex Bello   48   M    Married           25
1  Nadjie Solmayor   44   F    Married           40
0    Nick Solmayor   43   M     Single           45
4  Abelardo Ybanez   61   M  Seperated           60

In [6]:
n=100
number_of_times =0
while n >= 1:
    n//=2
    number_of_times+=1
print(number_of_times)

7